readme.org
#+latex_class: cn-article
#+latex_header: \lstset{language=c++,numbers=left,numberstyle=\tiny,basicstyle=\ttfamily\small,tabsize=4,frame=none,escapeinside=``,extendedchars=false,keywordstyle=\color{blue!70},commentstyle=\color{red!55!green!55!blue!55!},rulesepcolor=\color{red!20!green!20!blue!20!}}
#+title: Software Engineering Spring 2016
#+author: deepwaterooo

* 3/7/2015
- The overall designed still follows Vince's inital QRCode ideas, with modifications for detailed design with Todd, and I (server bandwidth potential issues were postphoned to be lower priority than overall framework flow). 
- SRS was reassigned to Todd.
- Half done with basic Android layout, but need to make views look nice still.
- Demoed partially done app to teammates today after class, required concrete images and coordinates for both android and iOS side from both Todd and Vince. And will modify parameters exactly like mock when I receive images and coordinates from Todd. 
- THREE more views need to generate, before scanning QRCode, thank you page after finish scanning, and a reminder for confirmation page after scanning before posting to the server (which view needs to be mocked still as well).
- *Technically challenges:* how to post information to server from app, and how to receive feedback information if we include this latter part in our project as well.
- Will continue work on this one as lower priority recently. 

* project design about QR Codes
- patent: http://www.google.com/patents/CN103346892A?cl=zh

- https://www.youtube.com/watch?v=CUAMBOaKj0I
  - for android only
  - gmail account, google apps account and Android device
  - Identity cards: csv import (employee id, name, surname), create identity cards....
  - UI: Arrival, Departure
  - Departures are automatically matched with arrivals and total duration is counted. 
  - more details, check for android: http://www.attendance.mobi/

* QRCode scanner tutorial
- http://code.tutsplus.com/tutorials/android-sdk-create-a-barcode-reader--mobile-17162

* QR code generator
- iPhone and Android, works for both~!
- http://keremerkan.net/qr-code-and-2d-code-generator/, at least for iPhone, iPad: Qrafter, Qrafter Pro
- Android Java: 
  - Official ZXing ("Zebra Crossing"): https://github.com/zxing/zxing
  - example using ZXing: http://www.journaldev.com/470/generate-qr-code-image-from-java-program
  - QRGen: a simple QRCode generation api for java built on top ZXING: https://github.com/kenglxn/QRGen
  - QR Codes in Java & Servlet: http://viralpatel.net/blogs/create-qr-codes-java-servlet-qr-code-java/

* RESTful web Server
- http://www.journaldev.com/470/generate-qr-code-image-from-java-program

** Google 6 steps introduction (for android?)
- https://nataliecleveland.wordpress.com/2012/02/28/attendance-with-qr-code/
** for iOS
- https://techinmusiced.wordpress.com/2013/02/21/update-on-attendance-2-and-using-qr-codes-for-attendance/
- http://www.engineerica.com/accuclass/accuclass-app
** Some references: 
- https://www.youtube.com/watch?v=B8FNCMF5gZA (I have NOT really finished this one, not sure if it helps.)

* 6.Students Attendance Tracker - iOS and Android application designed for taking attendance in class

Hi, classmate, 

this comment is about PROJECT #6: Students Attendance Tracker. 

Though this is for brainstorm project ideas, since my favorite project is somehow listed in #6 here already. I want to put some emphasize on this project so that there will be classmates who want to join and we form a team to make this project feasible for this software engineering spring semester. 

I have one basic Android App for finger drawing for my previous course project (for a quick view, the project can be accessed at https://github.com/deepwaterooo/AndroidAppProgramming), so I have basic knowledge for Android app programming, while I don't have any iOS app experience yet. 

I am commenting here to call for classmates who have iOS App experience or Java programming experience, or have interest in Android app programming to take some time think about it, and we together form a team, and make this project HAPPEN for the semester. 

I don't have any clear idea about the main design or functionality about this app neither, but we will work on it. 

Thanks. 
deepwaterooo

