readme.tex
% Created 2016-03-07 Mon 21:26
\documentclass[9pt,b5paper]{article}
\usepackage{graphicx}
\usepackage{xcolor}
\usepackage{xeCJK}
\setCJKmainfont{SimSun}
\usepackage{longtable}
\usepackage{float}
\usepackage{textcomp}
\usepackage{geometry}
\geometry{left=0cm,right=0cm,top=0cm,bottom=0cm}
\usepackage{multirow}
\usepackage{multicol}
\usepackage{listings}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{latexsym}
\usepackage{natbib}
\usepackage{fancyhdr}
\usepackage[xetex,colorlinks=true,CJKbookmarks=true,linkcolor=blue,urlcolor=blue,menucolor=blue]{hyperref}


\lstset{language=c++,numbers=left,numberstyle=\tiny,basicstyle=\ttfamily\small,tabsize=4,frame=none,escapeinside=``,extendedchars=false,keywordstyle=\color{blue!70},commentstyle=\color{red!55!green!55!blue!55!},rulesepcolor=\color{red!20!green!20!blue!20!}}
\author{deepwaterooo}
\date{\today}
\title{Software Engineering Spring 2016}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.7c)}}
\begin{document}

\maketitle
\tableofcontents


\section{3/7/2015}
\label{sec-1}
\begin{itemize}
\item The overall designed still follows Vince's inital QRCode ideas, with modifications for detailed design with Todd, and I (server bandwidth potential issues were postphoned to be lower priority than overall framework flow).
\item SRS was reassigned to Todd.
\item Half done with basic Android layout, but need to make views look nice still.
\item Demoed partially done app to teammates today after class, required concrete images and coordinates for both android and iOS side from both Todd and Vince. And will modify parameters exactly like mock when I receive images and coordinates from Todd.
\item THREE more views need to generate, before scanning QRCode, thank you page after finish scanning, and a reminder for confirmation page after scanning before posting to the server (which view needs to be mocked still as well).
\item \textbf{Technically challenges:} how to post information to server from app, and how to receive feedback information if we include this latter part in our project as well.
\item Will continue work on this one as lower priority recently.
\end{itemize}

\section{project design about QR Codes}
\label{sec-2}
\begin{itemize}
\item patent: \url{http://www.google.com/patents/CN103346892A?cl=zh}

\item \url{https://www.youtube.com/watch?v=CUAMBOaKj0I}
\begin{itemize}
\item for android only
\item gmail account, google apps account and Android device
\item Identity cards: csv import (employee id, name, surname), create identity cards\ldots{}.
\item UI: Arrival, Departure
\item Departures are automatically matched with arrivals and total duration is counted.
\item more details, check for android: \url{http://www.attendance.mobi/}
\end{itemize}
\end{itemize}

\section{QRCode scanner tutorial}
\label{sec-3}
\begin{itemize}
\item \url{http://code.tutsplus.com/tutorials/android-sdk-create-a-barcode-reader--mobile-17162}
\end{itemize}

\section{QR code generator}
\label{sec-4}
\begin{itemize}
\item iPhone and Android, works for both\textasciitilde{}!
\item \url{http://keremerkan.net/qr-code-and-2d-code-generator/}, at least for iPhone, iPad: Qrafter, Qrafter Pro
\item Android Java: 
\begin{itemize}
\item Official ZXing ("Zebra Crossing"): \url{https://github.com/zxing/zxing}
\item example using ZXing: \url{http://www.journaldev.com/470/generate-qr-code-image-from-java-program}
\item QRGen: a simple QRCode generation api for java built on top ZXING: \url{https://github.com/kenglxn/QRGen}
\item QR Codes in Java \& Servlet: \url{http://viralpatel.net/blogs/create-qr-codes-java-servlet-qr-code-java/}
\end{itemize}
\end{itemize}

\section{RESTful web Server}
\label{sec-5}
\begin{itemize}
\item \url{http://www.journaldev.com/470/generate-qr-code-image-from-java-program}
\end{itemize}

\subsection{Google 6 steps introduction (for android?)}
\label{sec-5-1}
\begin{itemize}
\item \url{https://nataliecleveland.wordpress.com/2012/02/28/attendance-with-qr-code/}
\end{itemize}
\subsection{for iOS}
\label{sec-5-2}
\begin{itemize}
\item \url{https://techinmusiced.wordpress.com/2013/02/21/update-on-attendance-2-and-using-qr-codes-for-attendance/}
\item \url{http://www.engineerica.com/accuclass/accuclass-app}
\end{itemize}
\subsection{Some references:}
\label{sec-5-3}
\begin{itemize}
\item \url{https://www.youtube.com/watch?v=B8FNCMF5gZA} (I have NOT really finished this one, not sure if it helps.)
\end{itemize}

\section{6.Students Attendance Tracker - iOS and Android application designed for taking attendance in class}
\label{sec-6}

Hi, classmate, 

this comment is about PROJECT \#6: Students Attendance Tracker. 

Though this is for brainstorm project ideas, since my favorite project is somehow listed in \#6 here already. I want to put some emphasize on this project so that there will be classmates who want to join and we form a team to make this project feasible for this software engineering spring semester. 

I have one basic Android App for finger drawing for my previous course project (for a quick view, the project can be accessed at \url{https://github.com/deepwaterooo/AndroidAppProgramming}), so I have basic knowledge for Android app programming, while I don't have any iOS app experience yet. 

I am commenting here to call for classmates who have iOS App experience or Java programming experience, or have interest in Android app programming to take some time think about it, and we together form a team, and make this project HAPPEN for the semester. 

I don't have any clear idea about the main design or functionality about this app neither, but we will work on it. 

Thanks. 
deepwaterooo
