readme.tex

\section{Hi Team:}
\label{sec-7}

few things that I am still confused about this project. 
\begin{enumerate}
\item I understand that we are going to re-build the sign in tracking app on Android and iOS devices but that is pretty much all I know about it. Can we have some more information? I would suggest if we can start a doc/scratch paper and just brainstorm something.
\item I know this trimester will end in may and considering we are all on full time working schedule, the time we actual have to work on it is not rich. So, maybe we need to speed things up a little bit? matter of fact, counting on the one time per week meet up at ITU isn't good enough in my opinion.
\item can we have our first team meeting before following Monday class? I am free anytime after 7pm. (somehow this questions should go first, I did it again)
\end{enumerate}

Thoughts and comments are welcomed. I can totally understand if you can't make to the meeting bc of traffic or location or scheduling issues but nothing stopping you from communicating through emails :)) 

hi team, 

Thanks Todd for bring these ideas up, and I cannot agree with you more. 

\begin{enumerate}
\item Requirement: Students attendance tracking app for Android and iOS devices for virtual classroom, and we may weak on virtual classroom side. I am on the same page as you are. On Last Monday evening, we mentioned this to course instructor, and team manager Nancy is responsible for writing to her and ask for previous project relative materials and information. Once we get those materials, we should have the base.

\item I liked this project a lot, and I would love to spend more time on this project to make it a successful, or at least fully-functional rather than previous team's complete failure experience. We could have team meeting a couple of times each week. One could simply be after Monday class ends, and we could schedule a fixed meeting time each week according to teammates.

\item As the project architecture, it was my mistake that I haven't prepared enough information for the project design yet. Considering our team's various background, I think we need close cooperation in order to make the project work. Only a couple of teammates have iOS app experience, and I don't even have Android testing background, a team meeting  before Monday's class will help a lot.

\item For meeting, I am open in the morning before 11:00am (or before 10:40), and after 6pm, while I am on campus on Tuesday, and Thursday evening as well for classes. So I would prefer meeting on Wednesday evening after 7pm, or in the morning or on Sunday evening. But I would have any problem with email/Wechat communications. By the way, my Wechat phone is: 4087070682, and id is: huang20140813.

\item I suggest that we all google and do some research on the mobile attendance app, come up with some ideas about functionality, basic ideas about attendance track, and virtual classroom, together with a choice of software engineering model and reason, and we will choose one. So that even we won't be able to make a meeting this weekend, we could have ideas collected for Monday's presentation.
\end{enumerate}

Comment back with ideas. 

\subsection{Here are some comments:}
\label{sec-7-1}

\begin{enumerate}
\item Tuesday evenging 5:40pm for meeting 20 minutes does NOT work for me. The reason I prefer after the course end is that I am occupied during 11:00am-6:00pm, and I am not available before 6:00pm unless it's in the morning hours. I hope this before/after class time meeting can be easy to reach an agreement.

\item I agree with Todd that meeting once and depends on class-time and 20 minutes meeting each week won't be able to make this project work. A second on campus meeting time will definitely help, but if it is really difficult to find a working time slot for all of us, we could consider online group meeting via all kinds of media.
\end{enumerate}

If some members are unreachable or irresponsible, I am not sure if we will have to meet another time with only the fully-functional ones/members and feedback to curse instructor. Because I want to make this project work, rather than just pass the semester. 

Hi Team, 

So far after a little bit googling, I feel that I agree with Wincent's ideas about QRCode generating and scanning to take attendance for students who can use either iPhone/iPad or android phones (feels like tons of apps are out there already\textasciitilde{}!). Unless someone else comes up with better ideas or strong rejection about some modules, I think we are pretty much following this blueprint.  

About the RESTFUL web service and API for instructors to generate barcode, I agree with the functionality which are required for the app, but theoretically, I haven't completely understood to how to design and implement them yet. But my opinion is that this idea is not creative and original, but it's feasible and practical for us to implement, and it can be a good practice for us to experience the whole process as a software engineering practice. 

I have listed a few links which I think could be helpful for us to get some idea about the functionality. Vincent, if you have better links for design or open source sub-projects, please share as well. Let's google a little bit more and we will have the meeting after today's class to organize ideas, confirm functionality, design a flow chat for the implementation if we are clear enough about we need to do. 

see you all in the evening. 
