readme.tex

\section{concerns}
\label{sec-8}

Hi team, mainly Vincent, Todd, for design technical. 

I have a few concerns that blocked me from falling asleep tonight. 

\begin{enumerate}
\item I Suspect about Back-end server ping-pong real-time responding. To avoid hard-ware device, we changed the scanning to be from student side using mobile. When 100 students are scanning and pinging to the server at the same time, there would be delay and irresponding or even dead of the server. Would parallel be possible, or is there any way to walk around this?

\item My android java QR code scanner, Todd's iOS (swift) scanner, and Vincent's Python framework (are you sure?) need to be compatible and be able to communicate.

\item Student side unique QR codes (or post information) could be a good choice to protect from cheating by insert cell phone number and extract wifi information from POST information, if this is something we can easily combine into our project.

\item We were forced to choose waterfall model, which means we stick to each stage goals. There are quite a few generators for both iOS and android, so Vincent, as the architect, I am not any person familiar with server side, so I still feel worried about the back-end server. We need a functional, demo-able mobile app project rather than anything fancy but eventually dead. So please make sure you have solutions for this. And if you have concerns and difficulties as well, let us know, and we could always focus on this server technical challenges first before we move on.

\item To ensure an effective discussion next Wednesday, let's (Todd, Vincent and me) post ideas, frameworks or solutions concerns about one day ahead so that others can digest the information and raise questions before the meeting.
\end{enumerate}

thanks. 
deepwaterooo

Hi Vince, Todd, 

I think REST is more a web framework style for HTTP calls, its efficient, but not the server overload problem solver. If 100 students are posting to the server, we will still have to consider distributed servers, which complicated the server so much. So i think the best way is still scan the students' QR Codes which were on their mobile phones from the course instructor's moible phone one by one (so we won't have any overload server problem). But this will require more work on Todd's and my front end app side. Todd, could you please help verify this server technical bottleneck as well? I just felt I have not been convince by Vince's listed out yesterday at all. 

I am into the patent paper from \url{http://www.google.com/patents/CN103346892A?cl=zh}, which is pretty good, ideas are straight forward. A couple of technical difficulties for wifi extraction/identification, which limits the cheating to have to be inside the building (inside the building the wifi doesn't help anymore for detecting cheating). Instead of paper QR Codes for attenders, we send unique QR Codes to students, store in the app somewhere, and make is uncopyable if posible. Let me know what you guys think. 


To process concurrent requests is a common thing when you are building a web server, right? That's why I'm saying that the current framework for REST api should have mechanism to handle that. I do some search on Flask (A Python framework) and there are ways to handle concurrent requests. 

\begin{enumerate}
\item You can enable threads in Flask. 2. You can deploy your Flask program on Apache server, and Apache will help to handle it. See the link below:
\end{enumerate}

\url{http://stackoverflow.com/questions/14814201/can-i-serve-multiple-clients-using-just-flask-app-run-as-standalone}
\url{http://stackoverflow.com/questions/14672753/handling-multiple-requests-in-flask}

Also, I believe for our demo purpose, not a production, the number of concurrent requests should not be too large, so a distributed server is not needed. 

The reason I don't like one-by-one scanning is that it takes time and students need to stand in queue. My original thought is that students can sit on their own chairs and do a QRCode scan and all set, which saves time. Well that's my personal thought and I will agree to others. Technically both are easy to implement. 

Hi Vince, 

I believe you are right that current framework for REST api has mechanism to handle multi-client calls, and that for demo propose, the number of concurrent requrests won't be too large, so there is no need for distributed servers. 

And just like you, I don't like the one by one long waiting as well. The reason I was kind of want to follow the patent paper was thinking about production. When we design, we want a good design which can go for production, and I have expected the well-designed project though I stated demo-able in previous email. As the team project named "Dorky" monkey, I am a person kind of dorky as well, and I would love to follow authority rather than random design without deep thinking, or which may run into various kinds of limitations for usage later on. I have thought that this project may server as the second/third generation of attendance tracking for ITU later on, but while, so far, maybe demo-able and use concurrency could be a good software engineering practice already, or we may run into difficulties to make a demo-able one. 

Though I felt slightly pity that the design or architecture of the project is not very salable, and most probably not developer-friendly for re-factoring neither, the design is still user-friendly for students. Just as Todd gave up saying anything, or maybe suspect that I have swapped roles, and you have enough confidence in your server and framework, I don't have problem with this design any more then. 

Please continue help prepare for the potential demo for coming meeting, and I may still have lots of questions about your server as well. :) And if you have any concerns about front side, please don't hesitate to point them out as well. 

thanks.
deepwaterooo

Hi Deepwaterooo£¬

I agree with you that when design, we should consider that it may finally become production and we need to think about the extensibility. I haven't gone into the detailed design yet because we haven't decided how our app works. I'm just doing some practice with Flask, AWS, MongoDB to see if it is a good choice. 

For the server side, why do you think the current design is not developer-friendly for re-factoring? Can you explain in more details? I'm wondering that are you preferring to design a regular web server rather than REST, or something else?

Vince

Vince, 

I think we have decided the five basic functionalities on Monday evening if I remember correctly. By the way, Todd, the documents recording the fucntionalities and work distribution you made and you shared with PM, could you please share with the rest of team as well? thanks. 

According to Monday's team meeting, Vic for testing, Vis so far goes together with PM for BRD, later on you will work on the server, I am on Android, and Todd will be for iOS. And up to coming meeting, we three, you, Todd and I need to do more research on QRCode. 

Monday's meeting we tried to figure out how should our app work. Since it was the first time we discuss about the ideas, I liked the efficiency of all the classmates scanning course instructor's QRCode at the same time, but only thought about the bottleneck later on when i tried to think it through, and that's the reason I pointed it out. And according to this experience, I suggest if we do the research, and get some ideas, would it be possible/ok that we list them out about one day before so that I could google and digest the new ideas deeper and better before I go the meeting. 
I am not a person on server side, but rather with limited basic knowledge about distributed systems. We will need to report progress on Monday, and we will have one meeting coming Wednesday, potentially solve most of the problems about design. I am saying "most probably" (not developer-friendly for re-factoring neither) not specifically for server side, but rather an impression that when we need a discussion, we go into a silence, so it will most probably end-up with each person one module, the contents, the detailed design, who takes the effort to care that much? That's my impression. Not for server side specifically, so please don't take it personally. 

My limited basic knowledge is on distributed system side, that's reason I tried to remind and understand the concern. As I stated earlier, i am not a person on server side, so I don't have any further questions on your server side. If you perfer to design a regular web server rather than REST, sorry, I can not offer any opinion on this. 

deepwaterooo
