readme.org
* Requirements
UML, 
use case diagrams
- figure out the requirements. 

- user story
- use case
- PM: approach of communicating with customer, online meeting or/vs email project contents (ok or not?)
   - stakeholder
   - user
   - custom: course instructor. Half an hour meeting, email, what (five? prioritize) are going into the project. 

* stage of team development
- Tuckman's ladder: 4 stages, 5?
  - Forming
  - Storming
  - Adjourning
  - Norming: work together
  - Performing
- Common Team problems

* System Architecture
  - software architecture
  - 

* Meeting Minutes
** 2/29/2016
- Balsamiq, tools

Software Engineering Week 4 Meeting - 29 Feb 2016

Meeting called to order at 7:20pm by PM Nancy Chiang.

Members present:
- Todd
- Vince
- Nancy
- Heyan
 
Members not present:
- Vikas

Reading of Agenda
 
- Motion: To analysis project elements
- Resolved: Agenda for the meeting for next meeting on 03/07 approved.
 
Approval of Minutes
 
- Motion: To review the meeting outcomes from the last meeting on 02/22.
- Resolved: Minutes from the meeting on 02/22 approved without modification.
 
Motions

- Necessary documentation for the project:
  - BRD - Business Requirement Documentation
  - SRS - Software Requirement Specification
  - Testing Documentation

- Motion for REVISED WBS: (work breakdown with ownership)
- Todd - Mock up 3.5H (mobile 1.5H + web page 2H)
- Vincent - ERD 6H
- Nancy - BRD 8H
- Vikas - User Case 6H
- Todd and Vikas - testing strategy 9H
- Todd and Heyan - technology requirements (SRS) 12H 
- Heyan - Android prototype 40H
- Vincent - server prototype 40H
- Nancy - project management (team meeting, progress reports) 20H

Discussions

- Topic: To decide elements/works hours to functional propose. 

- Solution: Revised WBS is settled 

Meeting adjourned at 8:30pm.

** 2/20/2016
Software Engineering Week 3 Meeting - 20 Feb 2016

Meeting called to order at 5:30pm by PM Nancy Chiang.

*** Members present:
- Todd
- Vince
- Nancy
 
*** Members not present:
- Heyan
- Vikas

*** Reading of Agenda
 
Motion: To outline meeting method, frequency, and frame of the whole project.
Resolved: Agenda for the meeting for next meeting on 03/07 approved.
 
Approval of Minutes
 
Motion: To review the meeting outcomes from last meeting on 02/08.
Resolved: Minutes from the meeting on 02/08 approved without modification.
 
*** Motions
-  Necessary documentation for the project:
  - BRD - Business Requirement Documentation
  - SRS - Software Requirement Specification
  - Testing Documentation

-  Motion for BRD:
1.     Who: Nancy
2.     Business-orientated information included project introduction, project process and project business requirement.
3.     Motion to 03/07 meeting: to build rough frame of BRD and to start to work on contents.

-  Motion for SRS:
1.     Who: Vince, Todd, and Heyan
2.     Functionality, UML and ERD, and technological requirement
  -  Functionality includes brief and Mock-UP
  -  UML included ERD and UI, ERD will provide information to User Case in BRD.
3.     Motion to 03/07 meeting: to build rough frame of Functionality and ERD.
 
*** Discussions
- Topic: To select method to prevent attendance cheating
- Solution: limited time to response to RQ code provided by instructor during class
- Meeting adjourned at 7:00pm.
