readme.tex

\section{Requirements}
\label{sec-9}
UML, 
use case diagrams
\begin{itemize}
\item figure out the requirements.

\item user story
\item use case
\item PM: approach of communicating with customer, online meeting or/vs email project contents (ok or not?)
\begin{itemize}
\item stakeholder
\item user
\item custom: course instructor. Half an hour meeting, email, what (five? prioritize) are going into the project.
\end{itemize}
\end{itemize}

\section{stage of team development}
\label{sec-10}
\begin{itemize}
\item Tuckman's ladder: 4 stages, 5?
\begin{itemize}
\item Forming
\item Storming
\item Adjourning
\item Norming: work together
\item Performing
\end{itemize}
\item Common Team problems
\end{itemize}

\section{System Architecture}
\label{sec-11}
\begin{itemize}
\item software architecture
\item 
\end{itemize}

\section{Meeting Minutes}
\label{sec-12}
\subsection{2/29/2016}
\label{sec-12-1}
\begin{itemize}
\item Balsamiq, tools
\end{itemize}

Software Engineering Week 4 Meeting - 29 Feb 2016

Meeting called to order at 7:20pm by PM Nancy Chiang.

Members present:
\begin{itemize}
\item Todd
\item Vince
\item Nancy
\item Heyan
\end{itemize}

Members not present:
\begin{itemize}
\item Vikas
\end{itemize}

Reading of Agenda

\begin{itemize}
\item Motion: To analysis project elements
\item Resolved: Agenda for the meeting for next meeting on 03/07 approved.
\end{itemize}

Approval of Minutes

\begin{itemize}
\item Motion: To review the meeting outcomes from the last meeting on 02/22.
\item Resolved: Minutes from the meeting on 02/22 approved without modification.
\end{itemize}

Motions

\begin{itemize}
\item Necessary documentation for the project:
\begin{itemize}
\item BRD - Business Requirement Documentation
\item SRS - Software Requirement Specification
\item Testing Documentation
\end{itemize}

\item Motion for REVISED WBS: (work breakdown with ownership)
\item Todd - Mock up 3.5H (mobile 1.5H + web page 2H)
\item Vincent - ERD 6H
\item Nancy - BRD 8H
\item Vikas - User Case 6H
\item Todd and Vikas - testing strategy 9H
\item Todd and Heyan - technology requirements (SRS) 12H
\item Heyan - Android prototype 40H
\item Vincent - server prototype 40H
\item Nancy - project management (team meeting, progress reports) 20H
\end{itemize}

Discussions

\begin{itemize}
\item Topic: To decide elements/works hours to functional propose.

\item Solution: Revised WBS is settled
\end{itemize}

Meeting adjourned at 8:30pm.

\subsection{2/20/2016}
\label{sec-12-2}
Software Engineering Week 3 Meeting - 20 Feb 2016

Meeting called to order at 5:30pm by PM Nancy Chiang.

\subsubsection{Members present:}
\label{sec-12-2-1}
\begin{itemize}
\item Todd
\item Vince
\item Nancy
\end{itemize}

\subsubsection{Members not present:}
\label{sec-12-2-2}
\begin{itemize}
\item Heyan
\item Vikas
\end{itemize}

\subsubsection{Reading of Agenda}
\label{sec-12-2-3}

Motion: To outline meeting method, frequency, and frame of the whole project.
Resolved: Agenda for the meeting for next meeting on 03/07 approved.

Approval of Minutes

Motion: To review the meeting outcomes from last meeting on 02/08.
Resolved: Minutes from the meeting on 02/08 approved without modification.

\subsubsection{Motions}
\label{sec-12-2-4}
\begin{itemize}
\item Necessary documentation for the project:
\begin{itemize}
\item BRD - Business Requirement Documentation
\item SRS - Software Requirement Specification
\item Testing Documentation
\end{itemize}

\item Motion for BRD:
\item Who: Nancy
\item Business-orientated information included project introduction, project process and project business requirement.
\item Motion to 03/07 meeting: to build rough frame of BRD and to start to work on contents.

\item Motion for SRS:
\item Who: Vince, Todd, and Heyan
\item Functionality, UML and ERD, and technological requirement
\begin{itemize}
\item Functionality includes brief and Mock-UP
\item UML included ERD and UI, ERD will provide information to User Case in BRD.
\end{itemize}
\item Motion to 03/07 meeting: to build rough frame of Functionality and ERD.
\end{itemize}

\subsubsection{Discussions}
\label{sec-12-2-5}
\begin{itemize}
\item Topic: To select method to prevent attendance cheating
\item Solution: limited time to response to RQ code provided by instructor during class
\item Meeting adjourned at 7:00pm.
\end{itemize}
% Emacs 24.3.1 (Org mode 8.2.7c)
\end{document}